In [132]:
import pandas as pd

In [133]:
#read excel
df_a = pd.read_excel('test061_df.xlsx', sheet_name='Sheet1')
df_a

   Id                Title  Release Date                           Memo
0   1             Iron Man         39570    Serial value(Not formatted)
1   2  The Incredible Hulk         39607                            NaN
2   3           Iron Man 2         40305  Custom format "m"月"d"日"yyyy"年
3   4                 Thor         40699                            NaN

In this notebook, I will demonstrate how to format date value of excel file.

### Turn serial value (a five digit number) to Python Datetime
When you read an excel file with python, you might get five digits number date.

In [134]:
serial_value = df_a.iloc[0,2]
print(serial_value)
type(serial_value)

39570

numpy.int64

Reference: https://www.geeksforgeeks.org/python-convert-excel-serial-date-to-datetime/

Option 1: xldate_as_datetime

In [135]:
import xlrd

In [136]:
python_date_a = xlrd.xldate_as_datetime(serial_value, 0)
python_date_a

datetime.datetime(2008, 5, 2, 0, 0)

In [137]:
df_a['Release Date'].apply(lambda x: xlrd.xldate_as_datetime(x, 0))

0   2008-05-02
1   2008-06-08
2   2010-05-07
3   2011-06-05
Name: Release Date, dtype: datetime64[ns]

Option 2: to_datetime

In [138]:
pd.to_datetime(df_a['Release Date'], unit='d', origin='1899-12-30')

0   2008-05-02
1   2008-06-08
2   2010-05-07
3   2011-06-05
Name: Release Date, dtype: datetime64[ns]

### Turn string value to Python Datetime

In [139]:
#read excel
df_b = pd.read_excel('test061_df.xlsx', sheet_name='Sheet2')
df_b

   Id                Title Release Date          Memo
0   1             Iron Man   May 2 2008  String value
1   2  The Incredible Hulk  June 8 2008           NaN
2   3           Iron Man 2   May 7 2010           NaN
3   4                 Thor   May 6 2011           NaN

In [140]:
string_value = df_b.iloc[0,2]
print(string_value)
type(string_value)

May 2 2008

str

Use strptime
Referece: https://www.geeksforgeeks.org/python-datetime-strptime-function/

In [141]:
python_date_b = datetime.strptime(string_value, '%B %d %Y')
python_date_b

datetime.datetime(2008, 5, 2, 0, 0)

In [142]:
pd.to_datetime(df_b['Release Date']).dt.strftime('%B %d, %Y')

0     May 02, 2008
1    June 08, 2008
2     May 07, 2010
3     May 06, 2011
Name: Release Date, dtype: object